In [1]:
import pandas as pd

In [2]:
#data structure
#series(1d)and dataframe(2d)

info={
"name":["riya","mahi","neha"],
"cgpa":[4.6,9.0,7.6]
}
df=pd.DataFrame(info)
print(df,type(df))


df1=pd.Series(info)
print(df1,type(df1))
print(df1[0])
print(df1[1])

   name  cgpa
0  riya   4.6
1  mahi   9.0
2  neha   7.6 <class 'pandas.core.frame.DataFrame'>
name    [riya, mahi, neha]
cgpa       [4.6, 9.0, 7.6]
dtype: object <class 'pandas.core.series.Series'>
['riya', 'mahi', 'neha']
[4.6, 9.0, 7.6]

C:\Users\radhi\AppData\Local\Temp\ipykernel_3396\572256914.py:14: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df1[0])
C:\Users\radhi\AppData\Local\Temp\ipykernel_3396\572256914.py:15: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df1[1])

In [4]:
#labels

s=pd.Series([34,2,4,55,22],index={"riya","babbu","mahi","diksha","pooja"})
print(s)

print(s["diksha"])
print(s.index)

diksha    34
riya       2
babbu      4
mahi      55
pooja     22
dtype: int64
34
Index(['diksha', 'riya', 'babbu', 'mahi', 'pooja'], dtype='object')

In [17]:
#vectorization
s1=pd.Series([1,4,6,7,7])
s2=pd.Series([1,4,6,7,7])
s1[0]=100
print(s1)
s1.add(88)
print(s1)
print(s1+s2)

0    100
1      4
2      6
3      7
4      7
dtype: int64
0    100
1      4
2      6
3      7
4      7
dtype: int64
0    101
1      8
2     12
3     14
4     14
dtype: int64

In [21]:
#DATAFRAMES
info={
    "name":["riya","radhika","mahi","mayank"],
    "age":[20,21,16,13],
    "cgpa":[9.0,8.9,7.9,6.7]
}
df=pd.DataFrame(info)
df

      name  age  cgpa
0     riya   20   9.0
1  radhika   21   8.9
2     mahi   16   7.9
3   mayank   13   6.7

In [23]:
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['name', 'age', 'cgpa'], dtype='object')

In [28]:
df=pd.DataFrame([["mahi",13,9.0],["diksha",31,9.0],["jassica",45,8.9]],columns=["name","age","cgpa"])
df

      name  age  cgpa
0     mahi   13   9.0
1   diksha   31   9.0
2  jassica   45   8.9

In [31]:
import numpy as np
np_arr=np.array([[1,2,3],[4,5,6]])
df=pd.DataFrame(np_arr,columns=["a","b","c"])
df

   a  b  c
0  1  2  3
1  4  5  6

In [35]:
#csv data 
df=pd.read_csv("employee_data.csv")
print(df)
print(df.index)
print(df.columns)

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000
RangeIndex(start=0, stop=10, step=1)
Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [52]:
#dataframe methods
df.head()
df.tail()
df.head(2)
df.sample(2)
df.info()
df.shape#print tuple
df.describe()
df.columns
df.nunique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

In [39]:
df=pd.read_json("employee_data.json")
print(df)

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000